package by.epam.oop.main;

/**
 *  2. Создать класс Payment с внутренним классом, с помощью объектов которого можно сформировать покупку из
 * 	нескольких товаров.
 */
public class App {
    public static void main( String[] args ){
        System.out.println( "Hello World!" );
    }
}
