package by.epam.oop.main;

/*
 * 1. Создать объект класса Текстовый файл, используя классы Файл, Директория. 
 * Методы: создать, переименовать, вывести на консоль содержимое, дополнить, удалить.
 */
public class Main {
    public static void main( String[] args ){
        System.out.println( "Hello one!" );
    }
}
